# Airbnb Recommendation System - Tokyo

# Business Problem
Airbnb wants to know which properties were popular in Tokyo and use that data to create more. 
Users also want to see which one to stay at.

In [2]:
import pandas as pd

Detailed Review Data

In [44]:
file_path = file_path = '/Users/harshithathota/Documents/Capstone/data/reviews 2.csv'

reviews_df = pd.read_csv(file_path)

In [25]:
reviews_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 451682 entries, 0 to 451681
Data columns (total 6 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   listing_id     451682 non-null  int64
 1   id             451682 non-null  int64
 2   date           451682 non-null  object
 3   reviewer_id    451682 non-null  int64
 4   reviewer_name  451681 non-null  object
 5   comments       451638 non-null  object
dtypes: int64(3), object(3)
memory usage: 20.7+ MB

In [26]:
reviews_df.head()

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,197677,554285,2011-09-21,1002142,Pablo,Couldn’t get any better!\r<br/>\r<br/>The apar...
1,197677,627651,2011-10-14,1031940,Ana & Ricardo,The apartment is bigger than it looks in the p...
2,197677,733040,2011-11-21,1097040,Samuel,The appartement is perfect for a couple! It is...
3,197677,755841,2011-11-30,1183674,Lisa,We had a terrific stay at Yoshimi and Marek's ...
4,197677,852938,2012-01-09,1538004,Langan,We loved our stay at the Oshiage Holiday Apart...

Detailed Listings data

Summary information and metrics for listings in Tokyo (good for visualisations).

In [11]:
list = list = '/Users/harshithathota/Documents/Capstone/data/listings.csv'
list = pd.read_csv(list)
list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12234 entries, 0 to 12233
Data columns (total 18 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              12234 non-null  int64
 1   name                            12234 non-null  object
 2   host_id                         12234 non-null  int64
 3   host_name                       12234 non-null  object
 4   neighbourhood_group             0 non-null      float64
 5   neighbourhood                   12234 non-null  object
 6   latitude                        12234 non-null  float64
 7   longitude                       12234 non-null  float64
 8   room_type                       12234 non-null  object
 9   price                           12234 non-null  int64
 10  minimum_nights                  12234 non-null  int64
 11  number_of_reviews               12234 non-null  int64
 12  last_review                     10776 non-null  object
 13  reviews_per_month               10776 non-null  float64
 14  calculated_host_listings_count  12234 non-null  int64
 15  availability_365                12234 non-null  int64
 16  number_of_reviews_ltm           12234 non-null  int64
 17  license                         12234 non-null  object
dtypes: float64(4), int64(8), object(6)
memory usage: 1.7+ MB

In [29]:
list.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,197677,Rental unit in Sumida · ★4.77 · 1 bedroom · 2 ...,964081,Yoshimi & Marek,NaN,Sumida Ku,35.717070,139.826080,Entire home/apt,12000,3,174,2023-08-13,1.19,1,39,8,M130003350
1,776070,Home in Kita-ku · ★4.98 · 1 bedroom · 1 bed · ...,801494,Kei,NaN,Kita Ku,35.738440,139.769170,Private room,8902,3,248,2023-08-27,1.88,1,116,18,M130000243
2,905944,Rental unit in Shibuya · ★4.77 · 2 bedrooms · ...,4847803,Best Stay In Tokyo!,NaN,Shibuya Ku,35.678780,139.678470,Entire home/apt,23740,3,194,2023-09-11,1.52,5,166,9,Hotels and Inns Business Act | 渋谷区保健所長 | 31渋健生...
3,1016831,Home in Setagaya · ★4.94 · 1 bedroom · 2 beds ...,5596383,Wakana,NaN,Setagaya Ku,35.658000,139.671340,Private room,24000,30,256,2023-09-18,2.01,1,53,45,M130001107
4,1196177,Home in 足立区 · ★4.73 · 1 bedroom · 1.5 shared b...,5686404,Yukiko,NaN,Adachi Ku,35.744731,139.797384,Private room,5200,2,100,2023-09-19,0.81,1,112,5,M130007760

Neighbourhood list for geo filter. Sourced from city or open source GIS files.

In [10]:
area = area = '/Users/harshithathota/Documents/Capstone/data/neighbourhoods.csv'
area = pd.read_csv(area)
area.head()

   neighbourhood_group   neighbourhood
0                  NaN       Adachi Ku
1                  NaN     Akiruno Shi
2                  NaN    Akishima Shi
3                  NaN  Aogashima Mura
4                  NaN      Arakawa Ku

Detailed Calendar Data

In [3]:
calendar = calendar = '/Users/harshithathota/Documents/Capstone/data/calendar.csv'
calendar = pd.read_csv(calendar)

In [4]:
calendar.head()

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,197677,2023-09-24,f,"$12,000.00","$12,000.00",3,1125
1,197677,2023-09-25,f,"$12,000.00","$12,000.00",3,1125
2,197677,2023-09-26,f,"$12,000.00","$12,000.00",3,1125
3,197677,2023-09-27,f,"$12,000.00","$12,000.00",3,1125
4,197677,2023-09-28,f,"$12,000.00","$12,000.00",3,1125

Reviews = Summary Review data and Listing ID (to facilitate time based analytics and visualisations linked to a listing).

In [22]:
df = df= '/Users/harshithathota/Documents/Capstone/data/reviews.csv'
df = pd.read_csv(df)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 451682 entries, 0 to 451681
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   listing_id  451682 non-null  int64
 1   date        451682 non-null  object
dtypes: int64(1), object(1)
memory usage: 6.9+ MB

In [32]:
merged_df = pd.merge(list, reviews_df, left_on='id', right_on='listing_id', how='inner')
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 451682 entries, 0 to 451681
Data columns (total 24 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   id_x                            451682 non-null  int64
 1   name                            451682 non-null  object
 2   host_id                         451682 non-null  int64
 3   host_name                       451682 non-null  object
 4   neighbourhood_group             0 non-null       float64
 5   neighbourhood                   451682 non-null  object
 6   latitude                        451682 non-null  float64
 7   longitude                       451682 non-null  float64
 8   room_type                       451682 non-null  object
 9   price                           451682 non-null  int64
 10  minimum_nights                  451682 non-null  int64
 11  number_of_reviews               451682 non-null  int64
 12  last_review                     451682 non-null  object
 13  reviews_per_month               451682 non-null  float64
 14  calculated_host_listings_count  451682 non-null  int64
 15  availability_365                451682 non-null  int64
 16  number_of_reviews_ltm           451682 non-null  int64
 17  license                         451682 non-null  object
 18  listing_id                      451682 non-null  int64
 19  id_y                            451682 non-null  int64
 20  date                            451682 non-null  object
 21  reviewer_id                     451682 non-null  int64
 22  reviewer_name                   451681 non-null  object
 23  comments                        451638 non-null  object
dtypes: float64(4), int64(11), object(9)
memory usage: 82.7+ MB

In [35]:
merged_df.isna().sum()

id_x                                   0
name                                   0
host_id                                0
host_name                              0
neighbourhood_group               451682
neighbourhood                          0
latitude                               0
longitude                              0
room_type                              0
price                                  0
minimum_nights                         0
number_of_reviews                      0
last_review                            0
reviews_per_month                      0
calculated_host_listings_count         0
availability_365                       0
number_of_reviews_ltm                  0
license                                0
listing_id                             0
id_y                                   0
date                                   0
reviewer_id                            0
reviewer_name                          1
comments                              44
dtype: int64

In [36]:
# filter date column for summer 2023
merged_df['date'] = pd.to_datetime(merged_df['date'], errors='coerce')

# Filter for summer 2023 (June 1, 2023, to August 31, 2023)
merged_df = merged_df[(merged_df['date'] >= '2023-06-01') & (merged_df['date'] <= '2023-08-31')]
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 55381 entries, 173 to 451585
Data columns (total 24 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id_x                            55381 non-null  int64
 1   name                            55381 non-null  object
 2   host_id                         55381 non-null  int64
 3   host_name                       55381 non-null  object
 4   neighbourhood_group             0 non-null      float64
 5   neighbourhood                   55381 non-null  object
 6   latitude                        55381 non-null  float64
 7   longitude                       55381 non-null  float64
 8   room_type                       55381 non-null  object
 9   price                           55381 non-null  int64
 10  minimum_nights                  55381 non-null  int64
 11  number_of_reviews               55381 non-null  int64
 12  last_review                     55381 non-null  object
 13  reviews_per_month               55381 non-null  float64
 14  calculated_host_listings_count  55381 non-null  int64
 15  availability_365                55381 non-null  int64
 16  number_of_reviews_ltm           55381 non-null  int64
 17  license                         55381 non-null  object
 18  listing_id                      55381 non-null  int64
 19  id_y                            55381 non-null  int64
 20  date                            55381 non-null  datetime64[ns]
 21  reviewer_id                     55381 non-null  int64
 22  reviewer_name                   55381 non-null  object
 23  comments                        55376 non-null  object
dtypes: datetime64[ns](1), float64(4), int64(11), object(8)
memory usage: 10.6+ MB